# Test_by_base_block
## *Дана задача*:

 Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


### *Примеры*:
    [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
    [“1234”, “1567”, “-2”, “computer science”] → [“-2”]
    [“Russia”, “Denmark”, “Kazan”] → []

## *Решение*:
1. Пользователь вводит с клавиатуры группы символов. 

        Console.WriteLine("Введите группы символов через пробел: ");
        string collection = Console.ReadLine();    
2. Из полученной строки при помощи метода __`Split()`__ создаем строковый массив.
3. Создаем пустую строку **sort**, в которую будем записывать отсортированные элементы массива.
4. При помощи цикла __`foreach`__ пройдем по всем элементам массива и т.к. элементами являются строки, проверим их длинуна соответствие условию при помощи свойства __`Length`__.
5. Если длина строки соответствует условию - записываем значение элемента в переменную **sort**.
6. После перебора всех элементов, полученную строку опять же при помощи метода __`Split()`__ преобразуем в новый строковый массив.
7. Выводим новый массив в консоль.        