# Test_by_base_block
## *Дана задача*:

 Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


### *Примеры*:
    [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
    [“1234”, “1567”, “-2”, “computer science”] → [“-2”]
    [“Russia”, “Denmark”, “Kazan”] → []

## *Решение*:
1. Пользователь вводит с клавиатуры группы символов. 

        Console.WriteLine("Введите группы символов через пробел: ");
        string collection = Console.ReadLine();    
2. Из полученной строки при помощи метода __`Split()`__ создаем строковый массив.

        string[] array = collection.Split(", ");
3. Создаем метод **GetSortArray**, который будет возвращать отсортированный массив строк. В методе: 
    + создаем пустую строку **sort**, в которую будем записывать отсортированные элементы массива;
    + при помощи цикла __`foreach`__ пройдем по всем элементам массива и т.к. элементами являются строки, проверим их длину на соответствие условию при помощи свойства __`Length`__;
    + если длина строки соответствует условию - записываем значение элемента в переменную **sort**;
    + после перебора всех элементов, полученную строку опять же при помощи метода __`Split()`__ преобразуем в новый строковый массив;
    + возвращаем отсортированный массив.

            string[] GetSortArray(string[] array)
            {
                string sort = String.Empty;
                foreach (var item in array)
                {
                    if (item.Length <= 3)
                    {
                        sort += item + " ";
                    }
                }
                string[] sortArray = sort.TrimEnd().Split(" ");
                return sortArray;
            }
4. Делаем вызов метода **GetSortArray** и выводим новый массив в консоль.

        Console.WriteLine($"[{String.Join(", ", GetSortArray(array))}]");        